perf/stress.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      rampTo: 40
      arrivalRate: 3
    - name: Plain
      duration: 30
      arrivalRate: 40

    

scenarios:
  - name: Stress (/)
    flow:
      - get:
          url: '/'